[
    {
        "url": "https://www.linkedin.com/jobs/view/analyst-data-analytics-at-bath-body-works-4214685107?position=1&pageNum=0&refId=kcRgZfx%2BC62XJs7FK3GcIg%3D%3D&trackingId=HoXIAdhTR47F0UnJ9nnnEA%3D%3D",
        "title": "Analyst, Data Analytics",
        "company": {
            "name": "Bath & Body Works",
            "url": "https://www.linkedin.com/company/bath-and-body-works?trk=public_jobs_topcard-org-name"
        },
        "location": "Columbus, OH",
        "applications": "Over 200 applicants",
        "salary": null,
        "description": "DescriptionAt Bath & Body Works, everyone belongs. We are committed to creating a diverse, equitable and inclusive culture focused on delivering exceptional fragrances and experiences to our customers. We focus on recruiting, retaining, and advancing diverse talent where our associate population is as diverse as the communities we serve, live and work. In addition, we work to improve our communities and our planet in a way that will make us proud for years to come because we believe the world is a brighter, happier place when everyone has access to the things that make them happy.The Data & Analytics – Marketing Business Partner Office serves as an analytic shared service to both internal and external partners. The team operates as subject matter experts in functional areas to understand analytic needs within the business, performs the analysis and deploys the results/solutions back to the business partners. This role is focused on support of the teams with a heavy emphasis on solving complex problems through via various programming languages and visualization tools.Responsibilities:Leverage and mine data assets to deliver actionable insights to marketing partnersCommunicate effectively with less technical business partners to understand business problems, suggest solutions, and measure outcomesPresent findings/observations to both junior and senior level teamsDevelop self-service business intelligence capabilities to serve the needs of marketersOwn data product development and maintenance for several marketing leadersDevelop subject matter expertise in data, measurement, ad technology trends, and customer targeting capabilities for selected marketing channelsProactively practices continuous learning and skill growth to optimize the support of initiatives and expand programming skills QualificationsRequired:1 to 2 years of coding, data analytics, and/or data visualization experienceExperience in SQLDemonstrated ability to breakdown complex business questions, to develop an analytic approach, to translate data into concise and actionable insights, and to present the insights back to non-technical business partnersWorks independently; receives support on new projectsMust have strong written and verbal communication skillsDesired:Experience with data analytics tools such as Hex, JuptyerLab, Snowflake/Snowpark, and PowerBIProficient in SQLIntroduction to Python/R or other advance data coding languageExperience with working in cloud environmentExperience working in a corporate retail environment with marketing cross-functional partnersExperience working in large data transformationsExperience in applying advanced analytic methodologies to business problems Education:Bachelor's degree or equivalent combination of education and experience requiredCore Competencies:Lead with Curiosity & HumilityBuild High Performing Teams for Today & TomorrowInfluence & Inspire with Vision & PurposeObserve, Engage & ConnectStrive to Achieve Operational ExcellenceDeliver Business ResultsBenefits:Bath & Body Works associates are the heart of our business. That’s why we're proud to offer benefits that empower you to Dream Bigger & Live Brighter. Benefits for eligible associates include:Robust medical, pharmacy, dental and vision coverage. Plus, access to our onsite wellness center and pharmacy located at the Columbus, OH home office.401k with company match and Associate Stock Purchase program with discountNo-cost mental health and wellbeing support through our Employee Assistance Program (EAP)Opportunity for paid time off, paid parental leave. Plus, access to family and lifestyle programs including an inclusive family building benefit, childcare discounts, and home, auto and pet insurance.Tuition reimbursement and scholarship opportunities for post-secondary education programs40% merchandise discount and gratis that encourages you to come back to your senses! Visit bbwbenefits.com for more details.The above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required.We will consider for employment all qualified applicants, including those with arrest records, conviction records, or other criminal histories, in a manner consistent with the requirements of any applicable state and local laws. Please see links: Los Angeles Fair Chance In Hiring Ordinance, Philadelphia Fair Chance Law, San Francisco Fair Chance Ordinance.We are an equal opportunity and affirmative action employer. We do not make employment decisions based on an individual’s race, color, religion, gender, gender identity, national origin, citizenship, age, disability, sexual orientation, marital status, pregnancy, genetic information, protected veteran status or any other legally protected status, and we comply with all laws concerning nondiscriminatory employment practices. We are committed to providing reasonable accommodations for associates and job applicants with disabilities. Our management team is dedicated to ensuring fulfillment of this policy with respect to recruitment, hiring, placement, promotion, transfer, training, compensation, benefits, associate activities and general treatment during employment. We only hire individuals authorized for employment in the United States. Application window will close when all role(s) are filled.Category: Information Technology\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "criteria": [
            {
                "name": "Seniority level",
                "value": "Associate"
            },
            {
                "name": "Employment type",
                "value": "Full-time"
            },
            {
                "name": "Job function",
                "value": "Project Management and Information Technology"
            },
            {
                "name": "Industries",
                "value": "Retail and Manufacturing"
            }
        ]
    },
    {
        "url": "https://www.linkedin.com/jobs/view/python-developer-junior-at-best-value-technology-incorporated-bvti-4202135522?position=2&pageNum=0&refId=kcRgZfx%2BC62XJs7FK3GcIg%3D%3D&trackingId=32I%2FnePqdjA%2BgjxWZ%2Fpc5A%3D%3D",
        "title": "Python Developer (Junior)",
        "company": {
            "name": "Best Value Technology Incorporated (BVTI)",
            "url": "https://www.linkedin.com/company/best-value-technology-incorporated?trk=public_jobs_topcard-org-name"
        },
        "location": "Maryland, United States",
        "applications": "Be among the first 25 applicants",
        "salary": null,
        "description": "CLEARANCE REQUIREMENT Must possess an active Top Secret/SCI clearance with an active polygraph. Both the clearance and polygraph need to be fully adjudicated. Interim clearances will not be accepted.U.S. Citizenship required in order to comply with government contracts.Best Value Technology, Inc. (BVTI) is a service-disabled veteran-owned small business (SDVOSB) who is looking to identify a junior level Python Developer to join our development team. The ideal candidate has a solid foundation in Python and Django, with hands-on experience working with MySQL databases, Linux-based systems, and web server configuration. This role also includes responsibilities for Tier 3 application support, helping to troubleshoot and resolve complex technical issues escalated by support teams.DUTIES AND RESPONSIBILITES Develop and maintain Django-based web applications.Write clean, maintainable, and efficient Python code.Design, query, and optimize MySQL databases.Assist with basic DevOps tasks such as deploying applications, managing services, and handling server updates on Linux systems.Configure and troubleshoot Apache web server issues.Provide Tier 3 application support, including investigating bugs, performance issues, and infrastructure-related problems.Perform quick-turnaround tasks requested by customers and operations staff, including generating custom reports.Work closely with support, QA, and DevOps teams to resolve production issues.Participate in code reviews and contribute to team knowledge sharing.Write and maintain technical documentation for features and support workflows.Required Knowledge And Skills 1+ years of experience with Python and Django (or strong academic/project experience).Solid understanding of relational databases, especially MySQL.Familiarity with basic Linux system administration (package installation, file permissions, logs, etc.).Experience configuring and working with Apache web server.Proficiency with Git version control.Strong problem-solving and debugging skills.Ability to communicate clearly with technical and non-technical stakeholders.Willingness to participate in on-call rotation or support coverage (if applicable).Desireable Skills Exposure to REST APIs.Experience with Docker or other containerization tools.Familiarity with automated testing frameworks.Basic front-end knowledge (HTML, CSS, JavaScript).Experience using ticketing systems like Redmine, Jira or ServiceNow.Exposure to AWS services such as EC2, RDS, S3, and related cloud infrastructure tools.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "criteria": [
            {
                "name": "Seniority level",
                "value": "Entry level"
            },
            {
                "name": "Employment type",
                "value": "Full-time"
            },
            {
                "name": "Job function",
                "value": "Engineering and Information Technology"
            },
            {
                "name": "Industries",
                "value": "IT Services and IT Consulting"
            }
        ]
    },
    {
        "url": "https://www.linkedin.com/jobs/view/python-developer-at-accroid-inc-4206685150?position=3&pageNum=0&refId=kcRgZfx%2BC62XJs7FK3GcIg%3D%3D&trackingId=FBM0r6y83vImdV%2BbYxrA%2BA%3D%3D",
        "title": "PYTHON DEVELOPER",
        "company": {
            "name": "Accroid Inc",
            "url": "https://www.linkedin.com/company/accroid-inc?trk=public_jobs_topcard-org-name"
        },
        "location": "Washington, DC",
        "applications": "25 applicants",
        "salary": null,
        "description": "Hybrid (4 Days Onsite)PYTHON DEVELOPER Candidate should have experience working in cloud repositories, preferably agile The developer should be able to build API’s, handle responses, and manage data flow between the frontend and backend. Strong knowledge of react is required\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "criteria": [
            {
                "name": "Seniority level",
                "value": "Entry level"
            },
            {
                "name": "Employment type",
                "value": "Contract"
            },
            {
                "name": "Job function",
                "value": "Engineering and Information Technology"
            },
            {
                "name": "Industries",
                "value": "IT Services and IT Consulting"
            }
        ]
    },
    {
        "url": "https://www.linkedin.com/jobs/view/data-entry-analyst-at-opportune-4214829414?position=4&pageNum=0&refId=kcRgZfx%2BC62XJs7FK3GcIg%3D%3D&trackingId=pEj6JnM6vIyPUa4SW7BVvA%3D%3D",
        "title": "Data Entry Analyst",
        "company": {
            "name": "Opportune",
            "url": "https://www.linkedin.com/company/opportune-llp?trk=public_jobs_topcard-org-name"
        },
        "location": "Houston, TX",
        "applications": "Over 200 applicants",
        "salary": null,
        "description": "Position Description:Assist the Land, Revenue, Joint Interest and Accounts Payable departments in various capacities of data entry as it relates to the company’s overall business objectives. The ideal candidate will be a team player, possess the ability to work independently, and complete various tasks within the designated time frame given. This position will report to the Division Order Manager in our Northwest, Houston office with responsibilities including, but not limited to, the following:Responsibilities:Ensure completeness and accuracy in the logging and tracking of owner and vendor analysis, new setups and changesResponsible for the scanning of pertinent name and address documentsAssist staff in maintaining name & address records in the system, tracking all necessary documentation received, updating all necessary direct deposit information upon client’s request, and corresponding with the client/land manager upon completion of these updatesAssist Opportune’s Owner Relations Specialists with owner inquiriesAssist staff in audit responsibilities as well as other additional tasksQualifications:Bachelors degree preferredExperience working in upstream oil & gas a plus, but not requiredWorking knowledge of oil & gas applications base data entry a plusWritten and verbal communication skills; excellent customer service skills with internal and external partiesProficiency with Microsoft Office software applications such as Word and ExcelFlexibility, multi-tasking, proficient typing, problem-solving, time management and organization skills required with meticulous attention to detailSelf-starter, fast learner, ability to work independently at assigned tasks and to work as a team member within the departmentWillingness to accept a work schedule with various demands which will vary as departmental workload/projects fluctuate.Location:Opportune LP- 10777 Clay Road, Suite 100, Houston, TX 77041 Compensation & Benefits:Opportune LP offers a competitive salary, hybrid schedule, and comprehensive benefits package.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "criteria": [
            {
                "name": "Seniority level",
                "value": "Entry level"
            },
            {
                "name": "Employment type",
                "value": "Full-time"
            },
            {
                "name": "Job function",
                "value": "Administrative"
            },
            {
                "name": "Industries",
                "value": "Business Consulting and Services and Oil and Gas"
            }
        ]
    },
    {
        "url": "https://www.linkedin.com/jobs/view/python-developer-at-the-dignify-solutions-llc-4211438841?position=5&pageNum=0&refId=kcRgZfx%2BC62XJs7FK3GcIg%3D%3D&trackingId=i6IkMqWIU5yfleWdFKBZpw%3D%3D",
        "title": "Python Developer",
        "company": {
            "name": "The Dignify Solutions, LLC",
            "url": "https://www.linkedin.com/company/dignify-solutions?trk=public_jobs_topcard-org-name"
        },
        "location": "New York, NY",
        "applications": "Be among the first 25 applicants",
        "salary": "$100,000.00/yr - $120,000.00/yr",
        "description": "Minimum 6 years of experience is a must. Strong Python Programming skill. Experience with Python Flask would be highly desired. Experience with Git and should be able to commit the code. Expert knowledge of SQL. Work experience of IDE (any) PyCharm, visual source code. Self-motivated with strong development skills and the ability to learn new technologies . Ability to handle complex scenarios, multiple tasks, challenging priorities and set schedule to meet deliverables with positive attitude and flexibility . Ability to work independently, collaborate as a member of a team, and build strong working relationships with partners and stakeholders . Ability to effectively communicate with internal and external technology teams\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "criteria": [
            {
                "name": "Seniority level",
                "value": "Mid-Senior level"
            },
            {
                "name": "Employment type",
                "value": "Full-time"
            },
            {
                "name": "Job function",
                "value": "Other"
            },
            {
                "name": "Industries",
                "value": "IT Services and IT Consulting"
            }
        ]
    },
    {
        "url": "https://www.linkedin.com/jobs/view/jr-python-developer-job-id-20250326-at-phoenix-cyber-4191430604?position=6&pageNum=0&refId=kcRgZfx%2BC62XJs7FK3GcIg%3D%3D&trackingId=qrc4xFwvzPdl3tLjnestZg%3D%3D",
        "title": "Jr. Python Developer [Job ID 20250326]",
        "company": {
            "name": "Phoenix Cyber",
            "url": "https://www.linkedin.com/company/phoenixcyber?trk=public_jobs_topcard-org-name"
        },
        "location": "Tampa, FL",
        "applications": "54 applicants",
        "salary": null,
        "description": "Phoenix Cyber is looking for security focused Python programmers to help develop custom plugins and 3rd party integrations for a commercial-off-the-shelf cybersecurity software product. The work involves designing, developing, and implementing data models, index structures, and storage strategies; ingesting/indexing processes and transforming/normalizing data to common standards using log aggregation tools (e.g., Elasticsearch and Splunk); enriching data upon ingest and querying; and creating queries against big data.This is a 100% remote, work-from-home position anywhere in the continental United States.Requirements:Minimum 2 years of strong Python programming experienceExperience in authoring and developing Python librariesExperience using REST and SOAP APIs to query and update data across multiple third-party applicationsExperience with Git, CI/CD and other development toolsExperience with cloud infrastructure and networking in AWS and/or AzureDegree in a STEM related discipline and/or a minimum 5 years of cybersecurity experienceNice to have:Experience with SOAR tools, Swimlane, Cyber Triage, PhantomExperience with the ELK (Elasticsearch, Logstash, Kibana) stack, Elastic Cloud on Kubernetes (ECK), Kafka, Beats, and/or SplunkExperience modeling with databases (relational/non-relational), especially MongoDBConfiguration management experience with Ansible/Terraform/Chef/PuppetExperience with container services (Docker, Kubernetes, etc.)Linux administration experiencePhoenix Cyber is a national provider of cybersecurity engineering services, operations services, sustainment services and managed security services to organizations determined to strengthen their security posture and enhance the processes and technology used by their security operations team. Phoenix Cyber is an equal opportunity employer and complies with Executive Order 11246, Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veteran's Readjustment Assistance Act (VEVRAA), all amendments to these regulations, and applicable executive orders, federal, and state regulations. Applicants are considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, and/or veteran status.Phoenix Cyber participates in E-Verify to confirm the employment eligibility of all newly-hired employees. To learn more about E-Verify, including your rights and responsibilities, go to https://www.e-verify.gov/\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "criteria": [
            {
                "name": "Seniority level",
                "value": "Entry level"
            },
            {
                "name": "Employment type",
                "value": "Full-time"
            },
            {
                "name": "Job function",
                "value": "Engineering and Information Technology"
            },
            {
                "name": "Industries",
                "value": "Financial Services, Software Development, and Technology, Information and Internet"
            }
        ]
    },
    {
        "url": "https://www.linkedin.com/jobs/view/python-developer-at-accroid-inc-4213015548?position=7&pageNum=0&refId=kcRgZfx%2BC62XJs7FK3GcIg%3D%3D&trackingId=SAXSnfQIDkMKJfaOkgTRng%3D%3D",
        "title": "Python Developer",
        "company": {
            "name": "Accroid Inc",
            "url": "https://www.linkedin.com/company/accroid-inc?trk=public_jobs_topcard-org-name"
        },
        "location": "Washington, DC",
        "applications": "102 applicants",
        "salary": null,
        "description": "We use in house developed ASR and we use google, nuance ASRsResponsible for text-to-speech project, speaker identification, wake up words identification for hands free devicesPipelines for ML trainingMain implementation language is python and sometimes javaMost services deployed in production and under heavy traffic (about 30 millions requests in 24 hours) as result we are helping with prod/qa infrastructure and monitoring systems﻿Help to develop production like services, understand infrastructure, help to identify and fix issues\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "criteria": [
            {
                "name": "Seniority level",
                "value": "Mid-Senior level"
            },
            {
                "name": "Employment type",
                "value": "Contract"
            },
            {
                "name": "Job function",
                "value": "Engineering and Information Technology"
            },
            {
                "name": "Industries",
                "value": "IT Services and IT Consulting"
            }
        ]
    },
    {
        "url": "https://www.linkedin.com/jobs/view/jr-python-developer-job-id-20250326-at-phoenix-cyber-4191429757?position=8&pageNum=0&refId=kcRgZfx%2BC62XJs7FK3GcIg%3D%3D&trackingId=d7sURKru0YSoPzOISQw09g%3D%3D",
        "title": "Jr. Python Developer [Job ID 20250326]",
        "company": {
            "name": "Phoenix Cyber",
            "url": "https://www.linkedin.com/company/phoenixcyber?trk=public_jobs_topcard-org-name"
        },
        "location": "Salt Lake City, UT",
        "applications": "64 applicants",
        "salary": null,
        "description": "Phoenix Cyber is looking for security focused Python programmers to help develop custom plugins and 3rd party integrations for a commercial-off-the-shelf cybersecurity software product. The work involves designing, developing, and implementing data models, index structures, and storage strategies; ingesting/indexing processes and transforming/normalizing data to common standards using log aggregation tools (e.g., Elasticsearch and Splunk); enriching data upon ingest and querying; and creating queries against big data.This is a 100% remote, work-from-home position anywhere in the continental United States.Requirements:Minimum 2 years of strong Python programming experienceExperience in authoring and developing Python librariesExperience using REST and SOAP APIs to query and update data across multiple third-party applicationsExperience with Git, CI/CD and other development toolsExperience with cloud infrastructure and networking in AWS and/or AzureDegree in a STEM related discipline and/or a minimum 5 years of cybersecurity experienceNice to have:Experience with SOAR tools, Swimlane, Cyber Triage, PhantomExperience with the ELK (Elasticsearch, Logstash, Kibana) stack, Elastic Cloud on Kubernetes (ECK), Kafka, Beats, and/or SplunkExperience modeling with databases (relational/non-relational), especially MongoDBConfiguration management experience with Ansible/Terraform/Chef/PuppetExperience with container services (Docker, Kubernetes, etc.)Linux administration experienceActive (ISC)2 CISSP certificationPhoenix Cyber is a national provider of cybersecurity engineering services, operations services, sustainment services and managed security services to organizations determined to strengthen their security posture and enhance the processes and technology used by their security operations team. Phoenix Cyber is an equal opportunity employer and complies with Executive Order 11246, Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veteran's Readjustment Assistance Act (VEVRAA), all amendments to these regulations, and applicable executive orders, federal, and state regulations. Applicants are considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, and/or veteran status.Phoenix Cyber participates in E-Verify to confirm the employment eligibility of all newly-hired employees. To learn more about E-Verify, including your rights and responsibilities, go to https://www.e-verify.gov/\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "criteria": [
            {
                "name": "Seniority level",
                "value": "Entry level"
            },
            {
                "name": "Employment type",
                "value": "Full-time"
            },
            {
                "name": "Job function",
                "value": "Engineering and Information Technology"
            },
            {
                "name": "Industries",
                "value": "Financial Services, Software Development, and Technology, Information and Internet"
            }
        ]
    },
    {
        "url": "https://www.linkedin.com/jobs/view/python-developer-at-accroid-inc-4214676352?position=9&pageNum=0&refId=kcRgZfx%2BC62XJs7FK3GcIg%3D%3D&trackingId=292%2FeavXiaJVtPJHXjfTRA%3D%3D",
        "title": "Python Developer",
        "company": {
            "name": "Accroid Inc",
            "url": "https://www.linkedin.com/company/accroid-inc?trk=public_jobs_topcard-org-name"
        },
        "location": "Washington, DC",
        "applications": "Over 200 applicants",
        "salary": null,
        "description": "Python asyncioPython grpcDockerDockers orchestration (Kubernetes, swarm)Common knowledge about Machine Learning tools like pytorchUnit testing\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "criteria": [
            {
                "name": "Seniority level",
                "value": "Mid-Senior level"
            },
            {
                "name": "Employment type",
                "value": "Contract"
            },
            {
                "name": "Job function",
                "value": "Engineering and Information Technology"
            },
            {
                "name": "Industries",
                "value": "IT Services and IT Consulting"
            }
        ]
    },
    {
        "url": "https://www.linkedin.com/jobs/view/software-engineer-python-at-rialtic-4187575411?position=10&pageNum=0&refId=kcRgZfx%2BC62XJs7FK3GcIg%3D%3D&trackingId=9jgcNO3O%2FqKhEG71k7wuiw%3D%3D",
        "title": "Software Engineer, Python",
        "company": {
            "name": "Rialtic",
            "url": "https://www.linkedin.com/company/rialtic-io?trk=public_jobs_topcard-org-name"
        },
        "location": "Atlanta, GA",
        "applications": "Be among the first 25 applicants",
        "salary": null,
        "description": "About RialticRialtic is an innovative enterprise software platform that enhances the capabilities of health insurers and healthcare providers, allowing them to manage their most crucial business operations efficiently.Established in 2020, Rialtic is supported by prominent investors such as Oak HC/FT, F-Prime Capital, Health Velocity Capital, and Noro-Moseley Partners. Our flagship payment accuracy solution centralizes previously outsourced functions, empowering health insurance companies to take full command of their operational processes. We collaborate with leading healthcare insurers and providers, addressing a critical $1 trillion challenge to reduce expenses, boost efficiency, and elevate the quality of care. To learn more about how we're driving innovation in healthcare, visit us at www.rialtic.io.Our CommitmentRialtic champions diversity, believing our collective strength is harnessed through inclusivity. We encourage applications from individuals of all backgrounds, as part of our commitment to creating an environment where diverse perspectives are valued and nurtured.We prioritize innovation, problem-solving, and the tangible value each team member brings to our mission. Here, you won't find rigid career ladders or title inflation — instead, we focus on creating opportunities for growth. To solve meaningful problems and make decisions that influence real change.The RoleWe're looking for an experienced Software Engineer to join our Engines team, which is responsible for the design, development, testing and maintenance of Python packages that implement healthcare policies defined by our internal Content team. The Engines team also maintains CI pipelines and templates in GitLab for each of our engines, libraries, and reference data packages. As a Senior Engineer, you will build engines in the current architecture, help implement new designs and build tools to support our internal Content team. We're built on a modern, cloud-first stack so you will contribute to the development and maintenance of containerized applications in the cloud that serve our engines and help with other processes used by our team and other teams at Rialtic.Core ResponsibilitiesDesign, develop, test and maintain Python packages that implement healthcare policies and conceptsServe as a peer reviewer for a colleague's code and approve merge requestsParticipate in architecture specification review including writing and reviewing design documentationWork with Principal and Staff Engineers on improvements to existing code and implementation of new designs, architectures and tools for process and coding improvements Work with the product management team to refine and break down user stories into concrete tasks for implementationPartner with other teams (including Content, Cloud and Core Claims) in defining and developing new functionality, as well as maintaining and improving the performance of existing codeWhat We Are Looking For3-5 years hands-on experience as a software engineer in a professional environment2+ years of experience working in Python and on Python applications, including Python dependency management, packaging and publishing toolsExtensive and long-term (1+ years) involvement in at least two software projectsExperience with shell scripting, Git and continuous integration workflows/pipelinesExperience with SQL or similar query tools/languagesExperience in a professional environment with at least one compiled language (C, C++, C#, Golang, Rust, etc.)Experience building and debugging data-rich applicationsExperience with AWS, S3 and AthenaStrong listening and interpersonal skills. You consider yourself a lifelong learner and you are willing to read documentation, ask questions, explore and iterate to improve.Nice-to-HavesBachelor's or graduate degree in a related technical field such as CS, Math, Physics or EngineeringExperience with modern data engineering and data science tools such as Pandas, Jupyter notebooks, Airflow, etc.GitLab CI, Kubernetes, DockerFamiliarity or experience with modern BI and reporting toolsExperience in healthcare ITExperience in a start-up environmentDemonstrated success in a remote work environmentRialtic ValuesHigh Integrity - Do the right thing. Provide candid feedback. Be humble and respectful.Customer Value Comes First - Delivering value to customers is our North Star.Work as One Team - Collaborative, inclusive environment to advance our mission.Be Bold & Accountable - Speak up. Take accountability. Continually improve.Pursuit of Excellence - Innovate, iterate and chase the best possible outcomes.Take Care of Self & Others Prioritize health & well-being for yourself and teammates.Benefits IncludeWe value the health, happiness, and continuous growth of our employees. Our comprehensive benefits package is designed to provide dynamic support across various aspects of our employees' lives, ensuring they can thrive both professionally and personally.Competitive Salary and Meaningful Equity.Comprehensive Health Plans covering medical, dental, and vision needs.Wellness Reimbursements for maintaining physical health.Access to top-tier mental health services.Flexible Vacation Policy with Unlimited PTO.For more details about our benefits or to discuss how we can accommodate your needs, please contact us at talent@rialtic.io for accommodations. us.Salary TransparencyWe are committed to equitable compensation and regularly review our salary ranges to ensure they reflect market standards and internal fairness.Non-Discrimination PolicyRialtic is dedicated to fostering a workplace where everyone is treated with respect and dignity. We do not discriminate on any basis protected by law.Join Our TeamIf you're passionate about using your skills to make a tangible impact in healthcare technology, we'd love to hear from you. Embrace the opportunity to grow professionally and personally in a company that values your well-being and professional development. For more information or inquiries about our DEI practices, please contact us directly.Don't meet every single requirement?Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. If you're excited about this role but your past experience doesn't align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this or other roles.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "criteria": [
            {
                "name": "Seniority level",
                "value": "Mid-Senior level"
            },
            {
                "name": "Employment type",
                "value": "Full-time"
            },
            {
                "name": "Job function",
                "value": "Engineering and Information Technology"
            },
            {
                "name": "Industries",
                "value": "Hospitals and Health Care"
            }
        ]
    }
]